; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared3 - mode
	infrared5 - mode
	thermograph4 - mode
	spectrograph2 - mode
	spectrograph6 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star9 - direction
	Star10 - direction
	GroundStation12 - direction
	Star2 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 spectrograph6)
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph4)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation12)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation8)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(have_image Phenomenon13 infrared5)
	(have_image Phenomenon14 spectrograph2)
	(have_image Star15 thermograph4)
	(have_image Star15 infrared3)
	(have_image Phenomenon16 infrared3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 phenomenon13 groundstation12)
   deleted: (pointing satellite0 groundstation12)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 5
3. (turn_to satellite0 star2 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star2)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 phenomenon13 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 5
6. (take_image satellite0 phenomenon13 instrument0 infrared5)
   added: (have_image phenomenon13 infrared5)
   goals met: 1 of 5
7. (turn_to satellite0 phenomenon14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 5
8. (take_image satellite0 phenomenon14 instrument0 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 2 of 5
9. (turn_to satellite0 phenomenon16 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 5
10. (take_image satellite0 phenomenon16 instrument0 infrared3)
   added: (have_image phenomenon16 infrared3)
   goals met: 3 of 5
11. (turn_to satellite0 star15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star15)
   goals met: 3 of 5
12. (take_image satellite0 star15 instrument0 infrared3)
   added: (have_image star15 infrared3)
   goals met: 4 of 5
13. (take_image satellite0 star15 instrument0 thermograph4)
   added: (have_image star15 thermograph4)
   goals met: 5 of 5
